////////////////////////////////////////
//									  //
//			모코숲 문법 모음			 //
//			필요시 참고  			  //
//									  //
//									  //
////////////////////////////////////////
//변수 선언
var text = "hello";
/*
var 변수명 = 변수값;
*/
////////////////////////////////////////
//함수 선언
function say(){
	console.log("hello");
}
/*
function 함수명(){
	함수 호출 시 실행할 코드
}
*/
////////////////////////////////////////
//계산
console.log(1 + 2);
/*
덧셈: n + n
뺄셈: n - n
곱셈: n * n
나눗셈: n / n
나눈 나머지: n % n
*/
////////////////////////////////////////
//조건문
if(1 == 1){
	console.log("1은 1이다");
}else{
	console.log("1은 1이 아니다");
}
/*
if(조건문){
	조건이 참일 시 실행할 코드
}else{ <== 선택사항 (불필요시 생략 가능)
	조건이 거짓일 시 실행할 코드
}
조건:
n == n 			=>	n이 n과 같을 경우
n !== n 		+> 	n이 n과 다를 경우
*/
////////////////////////////////////////
//반복문
for(i=0; i<10; i++){
	console.log(i);
}
/*
for(변수명=0; 변수명<반복회수; 변수명++){
	반복하면서 실행할 코드
}
*/
////////////////////////////////////////
